tap "homebrew/cask"

# 版本控制
brew "git"
brew "gh"
brew "git-delta"
brew "lazygit"
brew "matsuyoshi30/gitsu/gitsu"

# 编程语言
brew "python@3.14"
brew "go"

# Shell 增强
brew "starship"
brew "zoxide"
brew "fzf"
brew "fd"
brew "ripgrep"

# 系统工具
brew "htop"
brew "btop"
brew "curl"
brew "wget"
brew "vim"
brew "neovim"
brew "tree"
brew "jq"

# 容器工具
# brew "podman"  # 可选：Docker 替代品，Podman 免费版可商用、Docker Desktop 和 OrbStack 需要付费版才支持商用

# Python 包管理
brew "uv"

# 字体
cask "font-maple-mono-nf-cn"
cask "font-jetbrains-mono-nerd-font"
